class Mock {
  late String id;

  Mock() {}

  List<num> filler(int i) => List.filled(i, 0);
  dynamic initBondTables() {
    return [
      {
        "title": "利率债",
        "weather": 1,
        "columns": ['', '1Y', '3Y', '5Y', '7Y', '10Y', '10Y+'],
        "rows": [
          {"name": "国债", "value": filler(6)},
          {"name": "国开", "value": filler(6)},
          {"name": "非国开", "value": filler(6)},
          {"name": "地方债", "value": filler(6)},
        ]
      },
      {
        "title": "信用债",
        "weather": 2,
        "columns": ['', '1M', '3M', '6M', '1Y', '3Y', '5Y', '7Y'],
        "rows": [
          {"name": "AAA+", "value": filler(7)},
          {"name": "AAA", "value": filler(7)},
          {"name": "AA+", "value": filler(7)},
          {"name": "AA", "value": filler(7)},
        ]
      },
      // {
      //   "title": "同业存单",
      //   "columns": ['', '14D', '1M', '3M', '6M', '9M', '1Y'],
      //   "rows": [
      //     {
      //       "name": "国有/股份行",
      //       "value": [-1, -1, 1, 1, 1, 1]
      //     },
      //     {
      //       "name": "AAA",
      //       "value": [-1, -1, 1, 1, 1, 1]
      //     },
      //     {
      //       "name": "AA+",
      //       "value": [-1, -1, 1, 0, 1, 1]
      //     },
      //   ]
      // }
    ];
  }

  dynamic initUser() {
    return {
      "id": "",
      "idQoo": "登录后才能拥有 ~",
      "idCard": "",
      "mobile": "",
      "email": "",
      "smsCode": "",
      "smsTime": "",
      "name": "",
      "nickname": "请登录 ~",
      "password": "",
      "avatar": "",
      "motto": "",
      "linkQq": "",
      "linkWechat": "",
      "isDeleted": false,
      "createTime": "",
      "updateTime": ""
    };
  }

  List<Map<String, dynamic>> initFundGroups() {
    return [
      {
        'id': 0,
        'name': '科学养鸡',
        'codes': [
          '006185',
          '016319',
          '003568',
          '010604',
          '016787',
          '012714',
          '006760',
          '015736',
          '010734',
          '007745',
          '009456',
          '006258',
          '003103'
        ]
      },
      {
        'id': 1,
        'name': '当年亏过的鸡',
        'codes': [
          '000960', // -8800
          '002199', // -8771
          '011041', // -3799
          '003096', // -2024
          '002959', // -1536
          '260108', // -1521
          '005827', // -1465
          '163208', // -1365
          '006482', // -1284
          '005461', // -1107
          '006327', // -1070
          '000536', // -1001
          '000297', // -1000
          '007301', // -900
          '001156', // -887
          '481010', // -862
          '013275', // -834
          '210014', // -833
          '013943', // -822
          '110011', // -802
          '164906', // -792
          '070010', // -790
          '519732', // -733
          '000592', // -701
          '004789', // -696
          '470888', // -692
          '240018', // -680
          '001188', // -502
          '163817', // -493
          '005312', // -402
          // '007280', // -386 有一天的净值是 --
          '420001', // -321
          '270007', // -287
          '217022', // -285
          '011329', // -245
          '008593', // -228
          '004914', // -212
          '011103', // -172
          '164206', // -159
          '000746', // -104
        ]
      },
      {
        'id': 2,
        'name': '目前定投的鸡',
        'codes': ['163208', '013275', '000746', '070010', '000592']
      }
    ];
  }

  dynamic initBingWallPaper() {
    return {
      "date": "2023-08-19",
      'headline': "我准备好拍特写了，松鼠先生",
      'title': "看着相机镜头的松鼠",
      'description':
          "1839年的8月19日，法国画家达盖尔公布了其发明的达盖尔摄影法，即银版摄影法，这被认为是最早的具有实用价值的摄影法。因此每年的8月19日被定位世界摄影日。摄影的世界是广阔的，专业人士和业余爱好者所涉足的摄影主题和风格也是多种多样的。无论是抽象还是时尚，抑或是风景和野生动物，都可以成为摄影的主题。图上这只厚脸皮的松鼠就是一个例子。尽管随着数码相机和智能手机的问世，达盖尔摄影法之类的老式摄影法早已过时，但却仍有一些摄影师还在竭力保持老式摄影的魅力和艺术性。",
      'image_url':
          "https://cn.bing.com/th?id=OHR.CameraSquirrel_ZH-CN3580119980_1920x1080.webp",
      'main_text': "世界上第一张照片是由法国科学家约瑟夫·尼塞福尔·涅普斯在1826年拍摄出来的。"
    };
  }

  testGetUserId() {}
}
